EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
void configOutputCompare1(void) 
{
	T2CONbits.TON = 0;          //disable Timer when configuring Output compare
	CONFIG_OC1_TO_RP(RB0_RP);   //map OC1 to RB
	OC1RS = 0;  //clear both registers
	OC1R = 0;
#ifdef OC1CON1
//turn on the compare toggle mode using Timer2
	OC1CON1 = OC_TIMER2_SRC |     //Timer2 source
		OC_PWM_CENTER_ALIGN;  //PWM
	OC1CON2 = OC_SYNCSEL_TIMER2;   //synchronize to timer2
#else
//older families, this PWM mode is compatible with center-aligned, OC1R=0
//as writes to OC1RS sets the pulse widith.
	OC1CON = OC_TIMER2_SRC |     //Timer2 source
		OC_PWM_FAULT_PIN_DISABLE;  //PWM, no fault detection
#endif
}

void _ISR _T2Interrupt(void) 
{
	uint32_t u32_temp;
	_T2IF = 0;    //clear the timer interrupt bit
	//update the PWM duty cycle from the ADC value
	u32_temp = ADC1BUF0;  //use 32-bit value for range
	//compute new pulse width that is 0 to 99% of PR2
	// pulse width (PR2) * ADC/1024
	u32_temp = (u32_temp * (PR2))>> 10 ;  // >>10 is same as divide/1024
	OC1RS = u32_temp;  //update pulse width value
	SET_SAMP_BIT_ADC1();      //start sampling and conversion
}
#endif
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
int pack(UCHAR low_byte, UCHAR high_byte)
{
	int temp;
	int myint;
	low_byte = ~low_byte;
	myint = (int)low_byte;
	temp = (int)high_byte;
	temp <<= 8;
	myint |= temp;
	return myint;
}
//******************************************************************************************//
//******************************************************************************************//
//******************************************************************************************//
void unpack(int myint, UCHAR *low_byte, UCHAR *high_byte)
{
	*low_byte = (UCHAR)myint;
	myint >>= 8;
	*high_byte = (UCHAR)myint;
	*low_byte = ~(*low_byte);
}
void process_comm2(UCHAR key)
{
}
//******************************************************************************************//
//************************************* PIC_DispCharAt *************************************//
//******************************************************************************************//
void PIC_DispCharAt(UINT row, UINT col, UCHAR c)
{
    static ESOS_TASK_HANDLE handle;
	static ULONG send1;
	static ULONG send2;
	static UCHAR temp;
	
	handle = esos_GetTaskHandle(send_comm1);
//	temp = DEBUG_CHAR_AT;
	send1 = (UINT)temp;
	send2 = (UINT)row;
	send2 <<= 8;
	send1 |= send2;
	send2 = (UINT)col;
	send2 <<= 16;
	send1 |= send2;
	send2 = (UINT)c;
	send2 <<= 24;
	send1 |= send2;
/* 	memcpy(buff+1,&row,sizeof(UINT));
	memcpy(buff+3,&col,sizeof(UINT));
	memcpy(buff+5,&c,sizeof(UCHAR));
	buff[6] = 0xff;
	size_buff = 7;
 */
	__esos_CB_WriteUINT32(handle->pst_Mailbox->pst_CBuffer,send1);
}
// 			_dispStringAt(0x30, 0x31,"test string\0");

void GDispCharAt(UCHAR row, UCHAR col, char c)
{
    static ESOS_TASK_HANDLE handle;
    static UCHAR data1;
    
	if(col == 0)
	{
		handle = esos_GetTaskHandle(send_comm1);
		return;
	}
		
	data1 = row;

	if(data1 == KP_POUND)
		__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,0x79);

/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(CHAR_AT_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(row);
	ESOS_TASK_WAIT_ON_SEND_UINT82(col);
	ESOS_TASK_WAIT_ON_SEND_UINT82(c);
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
void GDispStringAt(UCHAR row, UCHAR col, char *str)
{
	int str_len = strlen(str);
	int i;
    static ESOS_TASK_HANDLE handle;
    static UCHAR data1;
    
	if(col == 0)
	{
		handle = esos_GetTaskHandle(send_comm1);
		return;
	}
		
	data1 = row;

	__esos_CB_WriteUINT8(handle->pst_Mailbox->pst_CBuffer,data1);

/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(STRING_AT_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(row);
	ESOS_TASK_WAIT_ON_SEND_UINT82(col);
	ESOS_TASK_WAIT_ON_SEND_UINT82((UCHAR)str_len);
	ESOS_TASK_WAIT_ON_SEND_UINT82((UCHAR)(str_len >> 8));
	for(i = 0;i < str_len;i++)
		ESOS_TASK_WAIT_ON_SEND_UINT82(*(str + i);
		
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
void GDispSetCursor(UCHAR mode, UCHAR row, UCHAR col, UCHAR type)
{
/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(SET_CURSOR_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(mode);
	ESOS_TASK_WAIT_ON_SEND_UINT82(row);
	ESOS_TASK_WAIT_ON_SEND_UINT82(col);
	ESOS_TASK_WAIT_ON_SEND_UINT82(type);
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
void GDispSetMode(UCHAR mode)
{
/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
	ESOS_TASK_WAIT_ON_SEND_UINT82(SET_MODE_CMD);
	ESOS_TASK_WAIT_ON_SEND_UINT82(mode);
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
}
